plugins/haltr/test/fixtures/documents/invoice_facturae32_issued3.xml

<?xml version="1.0" encoding="UTF-8"?>
<facturae:Facturae xmlns:facturae="http://www.facturae.es/Facturae/2009/v3.2/Facturae" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.facturae.es/Facturae/2009/v3.2/Facturae http://www.facturae.es/NR/rdonlyres/2DF1A921-9E57-4A24-85D8-14FE74E0FB31/0/Facturaev3_2.xsd">
  <FileHeader>
    <SchemaVersion>3.2</SchemaVersion>
    <Modality>I</Modality>
    <InvoiceIssuerType>TE</InvoiceIssuerType>
    <ThirdParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>ESB63276174</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>Invinet Sistemes 2003, S.L</CorporateName>
        <AddressInSpain>
          <Address>Ribes 31</Address>
          <PostCode>08013</PostCode>
          <Town>Barcelona</Town>
          <Province>Barcelona</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
      </LegalEntity>
    </ThirdParty>
    <Batch>
      <BatchIdentifier>11048</BatchIdentifier>
      <InvoicesCount>1</InvoicesCount>
      <TotalInvoicesAmount>
        <TotalAmount>122.10</TotalAmount>
      </TotalInvoicesAmount>
      <TotalOutstandingAmount>
        <TotalAmount>122.10</TotalAmount>
      </TotalOutstandingAmount>
      <TotalExecutableAmount>
        <TotalAmount>122.10</TotalAmount>
      </TotalExecutableAmount>
      <InvoiceCurrencyCode>EUR</InvoiceCurrencyCode>
    </Batch>
  </FileHeader>
  <Parties>
    <SellerParty>
      <TaxIdentification>
        <PersonTypeCode>F</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>77310058C</TaxIdentificationNumber>
      </TaxIdentification>
      <Individual>
        <Name>Ingenta</Name>
        <FirstSurname/>
        <AddressInSpain>
          <Address>Melió 113</Address>
          <PostCode>08720</PostCode>
          <Town>Vilafranca</Town>
          <Province>Barcelona</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
        <ContactDetails>
          <WebAddress/>
          <ElectronicMail>lluis@ingent.net</ElectronicMail>
        </ContactDetails>
      </Individual>
    </SellerParty>
    <BuyerParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>A13585625</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>A.M.I. S.L.</CorporateName>
        <AddressInSpain>
          <Address>Crta.Matadepera,309. L-17</Address>
          <PostCode>08225</PostCode>
          <Town>Terrassa</Town>
          <Province>Barcelona</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
        <ContactDetails>
          <ElectronicMail>mail@client1.com</ElectronicMail>
          <ContactPersons>23</ContactPersons>
        </ContactDetails>
      </LegalEntity>
    </BuyerParty>
  </Parties>
  <Invoices>
    <Invoice>
      <InvoiceHeader>
        <InvoiceNumber>100336</InvoiceNumber>
        <InvoiceDocumentType>FC</InvoiceDocumentType>
        <InvoiceClass>OO</InvoiceClass>
      </InvoiceHeader>
      <InvoiceIssueData>
        <IssueDate>2014-01-09</IssueDate>
        <InvoiceCurrencyCode>EUR</InvoiceCurrencyCode>
        <TaxCurrencyCode>EUR</TaxCurrencyCode>
        <LanguageName>en</LanguageName>
      </InvoiceIssueData>
      <TaxesOutputs>
        <Tax>
          <TaxTypeCode>01</TaxTypeCode>
          <TaxRate>0.00</TaxRate>
          <TaxableBase>
            <TotalAmount>10.00</TotalAmount>
          </TaxableBase>
          <TaxAmount>
            <TotalAmount>0.00</TotalAmount>
          </TaxAmount>
        </Tax>
        <Tax>
          <TaxTypeCode>01</TaxTypeCode>
          <TaxRate>21.00</TaxRate>
          <TaxableBase>
            <TotalAmount>10.00</TotalAmount>
          </TaxableBase>
          <TaxAmount>
            <TotalAmount>2.10</TotalAmount>
          </TaxAmount>
        </Tax>
      </TaxesOutputs>
      <InvoiceTotals>
        <TotalGrossAmount>20.00</TotalGrossAmount>
        <GeneralSurcharges>
          <Charge>
            <ChargeReason>paid in clients name</ChargeReason>
            <ChargeAmount>100.000000</ChargeAmount>
          </Charge>
        </GeneralSurcharges>
        <TotalGeneralSurcharges>100.00</TotalGeneralSurcharges>
        <TotalGrossAmountBeforeTaxes>120.00</TotalGrossAmountBeforeTaxes>
        <TotalTaxOutputs>2.10</TotalTaxOutputs>
        <TotalTaxesWithheld>0.00</TotalTaxesWithheld>
        <InvoiceTotal>122.10</InvoiceTotal>
        <TotalOutstandingAmount>122.10</TotalOutstandingAmount>
        <TotalExecutableAmount>122.10</TotalExecutableAmount>
      </InvoiceTotals>
      <Items>
        <InvoiceLine>
          <ReceiverTransactionReference>9987</ReceiverTransactionReference>
          <ItemDescription>with0iva</ItemDescription>
          <Quantity>1.0</Quantity>
          <UnitOfMeasure>01</UnitOfMeasure>
          <UnitPriceWithoutTax>10.000000</UnitPriceWithoutTax>
          <TotalCost>10.000000</TotalCost>
          <GrossAmount>10.000000</GrossAmount>
          <TaxesOutputs>
            <Tax>
              <TaxTypeCode>01</TaxTypeCode>
              <TaxRate>0.00</TaxRate>
              <TaxableBase>
                <TotalAmount>10.00</TotalAmount>
              </TaxableBase>
            </Tax>
          </TaxesOutputs>
        </InvoiceLine>
        <InvoiceLine>
          <ReceiverTransactionReference>9987</ReceiverTransactionReference>
          <ItemDescription>with21iva</ItemDescription>
          <Quantity>1.0</Quantity>
          <UnitOfMeasure>01</UnitOfMeasure>
          <UnitPriceWithoutTax>10.000000</UnitPriceWithoutTax>
          <TotalCost>10.000000</TotalCost>
          <GrossAmount>10.000000</GrossAmount>
          <TaxesOutputs>
            <Tax>
              <TaxTypeCode>01</TaxTypeCode>
              <TaxRate>21.00</TaxRate>
              <TaxableBase>
                <TotalAmount>10.00</TotalAmount>
              </TaxableBase>
            </Tax>
          </TaxesOutputs>
        </InvoiceLine>
      </Items>
      <PaymentDetails>
        <Installment>
          <InstallmentDueDate>2014-02-08</InstallmentDueDate>
          <InstallmentAmount>122.10</InstallmentAmount>
          <PaymentMeans>01</PaymentMeans>
        </Installment>
      </PaymentDetails>
    </Invoice>
  </Invoices>
</facturae:Facturae>
