test/fixtures/documents/invoice_facturae32_issued8.xml

<?xml version="1.0" encoding="UTF-8"?><facturae:Facturae xmlns:facturae="http://www.facturae.es/Facturae/2009/v3.2/Facturae" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.facturae.es/Facturae/2009/v3.2/Facturae http://www.facturae.es/NR/rdonlyres/2DF1A921-9E57-4A24-85D8-14FE74E0FB31/0/Facturaev3_2.xsd">
  <FileHeader>
    <SchemaVersion>3.2</SchemaVersion>
    <Modality>I</Modality>
    <InvoiceIssuerType>TE</InvoiceIssuerType>
    <ThirdParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>ESB63276174</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>Invinet Sistemes 2003, S.L</CorporateName>
        <AddressInSpain>
          <Address>Ribes 31</Address>
          <PostCode>08013</PostCode>
          <Town>Barcelona</Town>
          <Province>Barcelona</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
      </LegalEntity>
    </ThirdParty>
    <Batch>
      <BatchIdentifier>5640</BatchIdentifier>
      <InvoicesCount>1</InvoicesCount>
      <TotalInvoicesAmount>
        <TotalAmount>671.00</TotalAmount>
      </TotalInvoicesAmount>
      <TotalOutstandingAmount>
        <TotalAmount>671.00</TotalAmount>
      </TotalOutstandingAmount>
      <TotalExecutableAmount>
        <TotalAmount>671.00</TotalAmount>
      </TotalExecutableAmount>
      <InvoiceCurrencyCode>EUR</InvoiceCurrencyCode>
    </Batch>
    <FactoringAssignmentData>
      <Assignee>
        <TaxIdentification>
          <PersonTypeCode>J</PersonTypeCode>
          <ResidenceTypeCode>R</ResidenceTypeCode>
          <TaxIdentificationNumber>ESA12345678</TaxIdentificationNumber>
        </TaxIdentification>
        <LegalEntity>
          <CorporateName>A BANC, S.A.</CorporateName>
          <AddressInSpain>
            <Address>Street, 1</Address>
            <PostCode>08080</PostCode>
            <Town>BARCELONA</Town>
            <Province>BARCELONA</Province>
            <CountryCode>ESP</CountryCode>
          </AddressInSpain>
          <ContactDetails>
            <AdditionalContactDetails>20000000000000000000</AdditionalContactDetails>
          </ContactDetails>
        </LegalEntity>
      </Assignee>
      <PaymentDetails>
        <Installment>
          <InstallmentDueDate>2015-05-06</InstallmentDueDate>
          <InstallmentAmount>372.08</InstallmentAmount>
          <PaymentMeans>04</PaymentMeans>
          <AccountToBeCredited>
            <IBAN>ES1234567890123456789012</IBAN>
            <BankCode>ABCABCAAXXX</BankCode>
          </AccountToBeCredited>
          <CollectionAdditionalInformation>N1234567</CollectionAdditionalInformation>
          <DebitReconciliationReference>N1234567</DebitReconciliationReference>
        </Installment>
      </PaymentDetails>
      <FactoringAssignmentClauses>Clauses</FactoringAssignmentClauses>
    </FactoringAssignmentData>
  </FileHeader>
  <Parties>
    <SellerParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>77310058C</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>Ingent-lluís</CorporateName>
        <OverseasAddress>
          <Address>Melió 113</Address>
          <PostCodeAndTown>08720 Vilafranca</PostCodeAndTown>
          <Province>Barcelona</Province>
          <CountryCode>TUR</CountryCode>
        </OverseasAddress>
        <ContactDetails>
          <WebAddress/>
          <ElectronicMail>ESP6611111C@b2brouter.net</ElectronicMail>
        </ContactDetails>
      </LegalEntity>
    </SellerParty>
    <BuyerParty>
      <TaxIdentification>
        <PersonTypeCode>J</PersonTypeCode>
        <ResidenceTypeCode>R</ResidenceTypeCode>
        <TaxIdentificationNumber>ESP1700000A</TaxIdentificationNumber>
      </TaxIdentification>
      <LegalEntity>
        <CorporateName>David Copperfield</CorporateName>
        <AddressInSpain>
          <Address>Address1</Address>
          <PostCode>08720</PostCode>
          <Town>city</Town>
          <Province>state</Province>
          <CountryCode>ESP</CountryCode>
        </AddressInSpain>
        <ContactDetails>
          <ElectronicMail>suport@ingent.net</ElectronicMail>
          <ContactPersons/>
        </ContactDetails>
      </LegalEntity>
    </BuyerParty>
  </Parties>
  <Invoices>
    <Invoice>
      <InvoiceHeader>
        <InvoiceNumber>767</InvoiceNumber>
        <InvoiceDocumentType>FC</InvoiceDocumentType>
        <InvoiceClass>OO</InvoiceClass>
      </InvoiceHeader>
      <InvoiceIssueData>
        <IssueDate>2012-04-20</IssueDate>
        <InvoiceCurrencyCode>EUR</InvoiceCurrencyCode>
        <TaxCurrencyCode>EUR</TaxCurrencyCode>
        <LanguageName>en</LanguageName>
      </InvoiceIssueData>
      <TaxesOutputs>
        <Tax>
          <TaxTypeCode>01</TaxTypeCode>
          <TaxRate>21.00</TaxRate>
          <TaxableBase>
            <TotalAmount>100.00</TotalAmount>
          </TaxableBase>
          <TaxAmount>
            <TotalAmount>21.00</TotalAmount>
          </TaxAmount>
        </Tax>
        <Tax>
          <TaxTypeCode>01</TaxTypeCode>
          <TaxRate>10.00</TaxRate>
          <TaxableBase>
            <TotalAmount>500.00</TotalAmount>
          </TaxableBase>
          <TaxAmount>
            <TotalAmount>50.00</TotalAmount>
          </TaxAmount>
        </Tax>
      </TaxesOutputs>
      <InvoiceTotals>
        <TotalGrossAmount>600.00</TotalGrossAmount>
        <TotalGrossAmountBeforeTaxes>600.00</TotalGrossAmountBeforeTaxes>
        <TotalTaxOutputs>71.00</TotalTaxOutputs>
        <TotalTaxesWithheld>0.00</TotalTaxesWithheld>
        <InvoiceTotal>671.00</InvoiceTotal>
        <TotalOutstandingAmount>671.00</TotalOutstandingAmount>
        <TotalExecutableAmount>671.00</TotalExecutableAmount>
      </InvoiceTotals>
      <Items>
        <InvoiceLine>
          <ReceiverTransactionReference/>
          <ItemDescription>thing 1</ItemDescription>
          <Quantity>1.0</Quantity>
          <UnitOfMeasure>01</UnitOfMeasure>
          <UnitPriceWithoutTax>100.000000</UnitPriceWithoutTax>
          <TotalCost>100.000000</TotalCost>
          <GrossAmount>100.000000</GrossAmount>
          <TaxesOutputs>
            <Tax>
              <TaxTypeCode>01</TaxTypeCode>
              <TaxRate>21.00</TaxRate>
              <TaxableBase>
                <TotalAmount>100.00</TotalAmount>
              </TaxableBase>
            </Tax>
          </TaxesOutputs>
        </InvoiceLine>
        <InvoiceLine>
          <ReceiverTransactionReference/>
          <ItemDescription>thing 2</ItemDescription>
          <Quantity>2.0</Quantity>
          <UnitOfMeasure>01</UnitOfMeasure>
          <UnitPriceWithoutTax>100.000000</UnitPriceWithoutTax>
          <TotalCost>200.000000</TotalCost>
          <GrossAmount>200.000000</GrossAmount>
          <TaxesOutputs>
            <Tax>
              <TaxTypeCode>01</TaxTypeCode>
              <TaxRate>10.00</TaxRate>
              <TaxableBase>
                <TotalAmount>200.00</TotalAmount>
              </TaxableBase>
            </Tax>
          </TaxesOutputs>
        </InvoiceLine>
        <InvoiceLine>
          <ReceiverTransactionReference/>
          <ItemDescription>thing 3</ItemDescription>
          <Quantity>3.0</Quantity>
          <UnitOfMeasure>01</UnitOfMeasure>
          <UnitPriceWithoutTax>100.000000</UnitPriceWithoutTax>
          <TotalCost>300.000000</TotalCost>
          <GrossAmount>300.000000</GrossAmount>
          <TaxesOutputs>
            <Tax>
              <TaxTypeCode>01</TaxTypeCode>
              <TaxRate>10.00</TaxRate>
              <TaxableBase>
                <TotalAmount>300.00</TotalAmount>
              </TaxableBase>
            </Tax>
          </TaxesOutputs>
        </InvoiceLine>
      </Items>
      <PaymentDetails>
        <Installment>
          <InstallmentDueDate>2012-06-01</InstallmentDueDate>
          <InstallmentAmount>671.00</InstallmentAmount>
          <PaymentMeans>04</PaymentMeans>
          <AccountToBeCredited>
            <IBAN>ES8023100001180000012345</IBAN>
            <BIC>biiiiiiiiic</BIC>
          </AccountToBeCredited>
        </Installment>
      </PaymentDetails>
      <AdditionalData>
        <InvoiceAdditionalInformation>. . .</InvoiceAdditionalInformation>
      </AdditionalData>
    </Invoice>
  </Invoices>
</facturae:Facturae>
